<h1><center>EDA Analysis public data "Iowa liqour sales"</center></h1>

<p>Import additional libraries</p>

In [373]:
import pandas_gbq
import pandas as pd
import numpy as np
pd.options.mode.chained_assignment = None
pd.options.display.max_columns = 25

<h2><em>1. Data Sourcing</em></h2>

<p>Load DataFrame from BigQuery public data and save to csv<p>

In [11]:
df = pandas_gbq.read_gbq('select * from bigquery-public-data.iowa_liquor_sales.sales', project_id='smarttender-273707')

Downloading: 100%|██████████| 20349538/20349538 [1:12:07<00:00, 4702.71rows/s]

In [13]:
df.to_csv(r'C:\Users\semeniuk\Desktop\Cases\Case_Softconstruct\dataset.csv')

In [4]:
df = pd.read_csv(r'C:\Users\semeniuk\Desktop\Cases\Case_Softconstruct\dataset.csv')

C:\Users\semeniuk\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3145: DtypeWarning: Columns (15) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [5]:
df = df.drop(columns='Unnamed: 0')

In [6]:
df.head()

,invoice_and_item_number,date,store_number,store_name,address,city,zip_code,store_location,county_number,county,...,item_number,item_description,pack,bottle_volume_ml,state_bottle_cost,state_bottle_retail,bottles_sold,sale_dollars,volume_sold_liters,volume_sold_gallons
0,INV-03082000091,2017-02-03,3443,Super Saver Iv,1141 N Broadway,Council Bluffs,51503,POINT (-95.836515 41.270824),78.0,POTTAWATTA,...,42718,Malibu Coconut Rum,6,1750,16.49,24.74,6,148.44,10.5,2.77
1,INV-32301500018,2020-11-30,5869,Tobacco Outlet Plus #507 - Urbandale,6941 Douglas Ave,Urbandale,50322,POINT (-93.711504 41.629416),77.0,POLK,...,43138,Bacardi Limon,6,1750,15.00,22.50,6,135.00,10.5,2.77
2,INV-17059300006,2019-01-22,5326,Als Liquor,215 W. Milwaukee Ave,Storm Lake,50588,POINT (-95.202405 42.647492),11.0,BUENA VIST,...,43138,Bacardi Limon,6,1750,15.00,22.50,6,135.00,10.5,2.77
3,INV-29255800079,2020-08-05,3443,Super Saver Iv,1141 N Broadway,Council Bluffs,51503,POINT (-95.836515 41.270824),78.0,POTTAWATTA,...,42718,Malibu Coconut Rum,6,1750,16.99,25.49,6,152.94,10.5,2.77
4,INV-20691000018,2019-07-17,4239,Fareway Stores #850 / Spirit Lake,1906 Keokuk,Spirit Lake,51360,POINT (-95.106219 43.42157),30.0,DICKINSON,...,42718,Malibu Coconut Rum,6,1750,16.99,25.49,6,148.44,10.5,2.77

<h2><em>2. Data Cleaning</em></h2>

<h2><ul><li><strong>Missing values</strong></li></ul></h2>

In [7]:
df.isnull().sum()

invoice_and_item_number          0
date                             0
store_number                     0
store_name                       0
address                      79927
city                         79926
zip_code                     79971
store_location             1951877
county_number               156731
county                      156729
category                     16974
category_name                25040
vendor_number                    5
vendor_name                      3
item_number                      0
item_description                 0
pack                             0
bottle_volume_ml                 0
state_bottle_cost               10
state_bottle_retail             10
bottles_sold                     0
sale_dollars                    10
volume_sold_liters               0
volume_sold_gallons              0
dtype: int64

For all categorical string column apply lowercase and title functions to make the same register.

In [8]:
df['store_name'] = df['store_name'].apply(lambda x: x.lower().title() if type(x) == str else x)
df['address'] = df['address'].apply(lambda x: x.lower().title() if type(x) == str else x)
df['city'] = df['city'].apply(lambda x: x.lower().title() if type(x) == str else x)
df['county'] = df['county'].apply(lambda x: x.lower().title() if type(x) == str else x)
df['category_name'] = df['category_name'].apply(lambda x: x.lower().title() if type(x) == str else x)
df['vendor_name'] = df['vendor_name'].apply(lambda x: x.lower().upper() if type(x) == str else x)
df['item_description'] = df['item_description'].apply(lambda x: x.lower().title() if type(x) == str else x)

<p>As we can see, probably 6 fields(address, city, zip_code, store_location, county_number, county) can be filled based on store_number. Check this hypothesis</p>

<h3 style="margin-left: 50px;"><em>a). Analysis store_name and store_location</em></h3>

<p>For the first, check one-to-one relation for columns "store_number" and "store_name"</p>

In [9]:
print(df[['store_number', 'store_name']].drop_duplicates().shape)
print(df[['store_number']].drop_duplicates().shape)

(2768, 2)
(2521, 1)

It means that one store_number may have several store_name. 
Okay, then check reverse relations.

In [10]:
df.groupby('store_name').agg({'store_number': 'nunique'}).reset_index().sort_values(by='store_number', ascending=False)

                 store_name  store_number
2430           Urban Liquor             3
1212       Heartland Market             3
2109      Rolfe Area Market             3
2146                  Sauce             3
1908  New Star / Fort Dodge             3
...                     ...           ...
889       Dahl'S / Johnston             1
890      Dahl'S / Merle Hay             1
891            Dahl'S / Wdm             1
892     Dahl'S Foods / Ames             1
2641   Zapf'S Pronto Market             1

[2642 rows x 2 columns]

In [11]:
df[df['store_name'] == 'Urban Liquor'].head(2)

,invoice_and_item_number,date,store_number,store_name,address,city,zip_code,store_location,county_number,county,...,item_number,item_description,pack,bottle_volume_ml,state_bottle_cost,state_bottle_retail,bottles_sold,sale_dollars,volume_sold_liters,volume_sold_gallons
1075,S10479300051,2013-02-07,4614,Urban Liquor,6401 Douglas Ave Ste 1,Urbandale,50322,POINT (-93.705732 41.629411),77.0,Polk,...,37418,Popov Vodka 80 Prf,6,1750,8.49,12.74,6,76.44,10.5,2.77
3580,S21810400006,2014-10-15,4939,Urban Liquor,6401 Douglas Ave Ste 1,Urbandale,50322,POINT (-93.705732 41.629411),77.0,Polk,...,38008,Smirnoff Vodka 80 Prf Pet,6,1750,14.75,22.13,2,44.26,3.5,0.92

As expected, store_name we must use carefully in our conclusions and split by store_number.

<h3 style="margin-left: 50px;"><em>b). Analysis city</em></h3>

Fill n/a city values based on store_number because it's unique.<br>
For the first, check if the same shops have different city name.

In [12]:
df.groupby('store_number').agg({'city': 'nunique'}).reset_index().\
                sort_values(by='city', ascending=False).query('city > 1').drop(columns='city').\
                merge(df[['store_number', 'city']].drop_duplicates()[df['city'].notnull()], on='store_number', how='left')

<ipython-input-12-8852135ee217>:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  merge(df[['store_number', 'city']].drop_duplicates()[df['city'].notnull()], on='store_number', how='left')

    store_number        city
0           3782  Guttenberg
1           3782  Guttenburg
2           2543     Ottuwma
3           2543     Ottumwa
4           4668  Clear Lake
5           4668   Clearlake
6           3456  Clear Lake
7           3456   Clearlake
8           3822     Swisher
9           3822  Shueyville
10          3742      Lemars
11          3742     Le Mars
12          5300      Otumwa
13          5300     Ottumwa
14          9911      Grimes
15          9911   Urbandale
16          2604      Lemars
17          2604     Le Mars

As we can see, store '3822' and store '9911' have different city. Google it. Store '3822' located in Shueyville but store '9911' has the different adress into the different city. Fill n/a 50 rows randomly.

In [13]:
df['store_number'] = df['store_number'].astype('str')

In [14]:
#For store #3822
df.loc[df['store_number'] == '3822', 'city'] = 'Shueyville'
#For store #9911
df.loc[(df['store_number'] == '9911')&(df['city'].isnull()), 'city'] =\
                    df.loc[(df['store_number'] == '9911')&(df['city'].isnull()), 'city'].\
                    apply(lambda x: np.random.choice(['Grimes', 'Urbandale']))

For the next, manually find mistake similar <em>'Guttenberg'</em> and <em>'Guttenburg'</em> based on same name and Zip_code.

In [15]:
df.loc[df['city'] == "Arnold'S Park",'city'] = df.loc[df['city'] == "Arnold'S Park",'city'].\
                                                         apply(lambda x: 'Arnolds Park')
df.loc[df['city'] == "Clearlake",'city'] = df.loc[df['city'] == "Clearlake",'city'].apply(lambda x: 'Clear Lake')
df.loc[df['city'] == "Fort Atkinson",'city'] = df.loc[df['city'] == "Fort Atkinson",'city'].apply(lambda x: 'Ft. Atkinson')
df.loc[df['city'] == "Grand Mounds",'city'] = df.loc[df['city'] == "Grand Mounds",'city'].apply(lambda x: 'Grand Mound')
df.loc[df['city'] == "Guttenburg",'city'] = df.loc[df['city'] == "Guttenburg",'city'].apply(lambda x: 'Guttenberg')
df.loc[df['city'] == "Leclaire",'city'] = df.loc[df['city'] == "Leclaire",'city'].apply(lambda x: 'Le Claire')
df.loc[df['city'] == "Lemars",'city'] = df.loc[df['city'] == "Lemars",'city'].apply(lambda x: 'Le Mars')
df.loc[df['city'] == "Mount Pleasant",'city'] = df.loc[df['city'] == "Mount Pleasant",'city'].apply(lambda x: 'Mt Pleasant')
df.loc[df['city'] == "Mount Vernon",'city'] = df.loc[df['city'] == "Mount Vernon",'city'].apply(lambda x: 'Mt Vernon')
df.loc[df['city'] == "Otumwa",'city'] = df.loc[df['city'] == "Otumwa",'city'].apply(lambda x: 'Ottumwa')
df.loc[df['city'] == "Ottuwma",'city'] = df.loc[df['city'] == "Ottuwma",'city'].apply(lambda x: 'Ottumwa')
df.loc[df['city'] == "Saint Ansgar",'city'] = df.loc[df['city'] == "Saint Ansgar",'city'].apply(lambda x: 'St Ansgar')

<strong>Split table df into two batches: with null city and not null. Create table from batch with not null city and use table as dictionary for table with null city. Fill n/a value and concat two batches.</strong>

In [314]:
df_store_num_city = df[['store_number', 'city']][df['city'].notnull()].drop_duplicates().reset_index(drop=True)

df_isnull = df.loc[df['city'].isnull()]
print(df_isnull.shape)
df_notnull = df.loc[~df['city'].isnull()]

df_isnull = df_isnull.drop(columns='city')

df_isnull = df_isnull.merge(df_store_num_city, how='left', on='store_number')
print(df_isnull.shape)

df_filled = pd.concat([df_notnull, df_isnull])

(78420, 24)
(78420, 24)

In [315]:
df_filled[df_filled['city'].isnull()][['store_number']].groupby('store_number').agg({'store_number': 'nunique'})

              store_number
store_number
5320                     1

In [316]:
df_filled.loc[df_filled['store_number'] == '5320', 'city'] = 'city_5320'
df_filled.loc[df_filled['store_number'] == '5320', 'address'] = 'address_5320'
df_filled.loc[df_filled['store_number'] == '5320', 'zip_code'] = 'zipcode_5320'
df_filled.loc[df_filled['store_number'] == '5320', 'county_number'] = \
                                df_filled.groupby('county_number').agg({'city': 'count'}).reset_index().\
                                sort_values(by='city', ascending=False)['county_number'].iloc[0]
df_filled.loc[df_filled['store_number'] == '5320', 'county'] = 'county_5320'

In [317]:
df_filled['city'].isnull().sum()

0

<h3 style="margin-left: 50px;"><em>c). Fillna address and zip_code</em></h3>

In [318]:
df_store_num_city_address = df_filled[['store_number', 'city', 'address']][df_filled['address'].notnull()].\
                                        drop_duplicates(subset=['store_number', 'city'], keep='first').reset_index(drop=True)

df_isnull = df_filled.loc[df_filled['address'].isnull()]
print(df_isnull.shape)
df_notnull = df_filled.loc[~df_filled['address'].isnull()]

df_isnull = df_isnull.drop(columns='address')

df_isnull = df_isnull.merge(df_store_num_city_address, how='left', on=['store_number', 'city'])
print(df_isnull.shape)

df_filled = pd.concat([df_notnull, df_isnull])

(79080, 24)
(79080, 24)

In [319]:
df_filled['address'].isnull().sum()

1

In [320]:
df_filled[df_filled['address'].isnull()]

,invoice_and_item_number,date,store_number,store_name,address,city,zip_code,store_location,county_number,county,...,item_number,item_description,pack,bottle_volume_ml,state_bottle_cost,state_bottle_retail,bottles_sold,sale_dollars,volume_sold_liters,volume_sold_gallons
499,INV-05674000001,2017-06-22,9932,"3-Oaks Distillery, Llc",NaN,Dubuque,52002,POINT (-90.766335 42.516027),31.0,Dubuque,...,27890,3-Oaks Distillery Whiskey,12,750,21.6,32.4,1,388.8,0.75,0.19

In [321]:
df_filled.loc[df_filled['store_number'] == '9932', 'address'] = 'address_9932'

--------

In [322]:
df_store_num_city_zip = df_filled[['store_number', 'city', 'zip_code']][df_filled['zip_code'].notnull()].\
                                        drop_duplicates(subset=['store_number', 'city'], keep='first').reset_index(drop=True)

df_isnull = df_filled.loc[df_filled['zip_code'].isnull()]
print(df_isnull.shape)
df_notnull = df_filled.loc[~df_filled['zip_code'].isnull()]

df_isnull = df_isnull.drop(columns='zip_code')

df_isnull = df_isnull.merge(df_store_num_city_zip, how='left', on=['store_number', 'city'])
print(df_isnull.shape)

df_filled = pd.concat([df_notnull, df_isnull])

(79124, 24)
(79124, 24)

In [323]:
df_filled['zip_code'].isnull().sum()

0

<h3 style="margin-left: 50px;"><em>d). Fillna county and county_number</em></h3>

Because county and county_number very valuable values, analyze naming of county.

In [324]:
df_filled.groupby('store_number').agg({'county': 'nunique'}).reset_index().\
                sort_values(by='county', ascending=False).query('county > 1').drop(columns='county').\
                merge(df_filled[df_filled['county'].notnull()][['store_number', 'county']].\
                drop_duplicates(), on='store_number', how='left')

    store_number         county
0           4867  Pottawattamie
1           4867     Pottawatta
2           3477     Pottawatta
3           3477  Pottawattamie
4           4741  Pottawattamie
..           ...            ...
181         3713     Cerro Gord
182         5195     Pottawatta
183         5195  Pottawattamie
184         4808  Pottawattamie
185         4808     Pottawatta

[186 rows x 2 columns]

As we can see, many county value have similar name but not the same, fix it.

In [325]:
df_filled.loc[df_filled['county'] == "Cerro Gord", 'county'] = \
                df_filled.loc[df_filled['county'] == "Cerro Gord", 'county'].apply(lambda x: 'Cerro Gordo')
df_filled.loc[df_filled['county'] == "Pottawatta", 'county'] = \
                df_filled.loc[df_filled['county'] == "Pottawatta", 'county'].apply(lambda x: 'Pottawattamie')
df_filled.loc[df_filled['county'] == "Buena Vist", 'county'] = \
                df_filled.loc[df_filled['county'] == "Buena Vist", 'county'].apply(lambda x: 'Buena Vista')
df_filled.loc[df_filled['county'] == "Obrien", 'county'] = \
                df_filled.loc[df_filled['county'] == "Obrien", 'county'].apply(lambda x: "O'Brien")

In [326]:
df_county = df_filled[(df_filled['county'].notnull())&(df_filled['county_number'].notnull())].\
                groupby(['store_number', 'city', 'county', 'county_number']).\
                agg({'store_name': 'count'}).sort_values(by='store_name', ascending=False).reset_index()
df_county = df_county.drop_duplicates(subset=['store_number', 'city'], keep='first').reset_index(drop=True)
df_county = df_county.drop(columns='store_name')

In [327]:
df_isnull = df_filled.loc[(df_filled['county'].isnull())|(df_filled['county_number'].isnull())]
print(df_isnull.shape)
df_notnull = df_filled.loc[~((df_filled['county'].isnull())|(df_filled['county_number'].isnull()))]

df_isnull = df_isnull.drop(columns=['county', 'county_number'])

df_isnull = df_isnull.merge(df_county, how='left', on=['store_number', 'city'])
print(df_isnull.shape)

df_filled = pd.concat([df_notnull, df_isnull])

(155884, 24)
(155884, 24)

In [328]:
df_filled[df_filled['county'].isnull()].\
            groupby(['store_number', 'address', 'city', 'store_name']).agg({'store_number': 'nunique'})

                                                                                           store_number
store_number address                city             store_name
5220         2771, 4Th St Sw        Mason City       Liquor Tobacco & Grocery / Mason Cit             1
9936         1685 W Uintah St. #101 Colorado Springs Dash Events Llc                                  1

Google it, and fill.

In [329]:
df_filled.loc[df_filled['store_number'] == '5220', 'county'] = 'Cerro Gordo'
df_filled.loc[df_filled['store_number'] == '5220', 'county_number'] = '17'

# And Colorado Springs not in IOWA, drop this rows.
df_filled = df_filled[df_filled['city'] != 'Colorado Springs']

In [330]:
print(df_filled['county'].isnull().sum())
print(df_filled['county_number'].isnull().sum())

0
0

In [331]:
# New shape
df_filled.shape

(20349536, 24)

<h3 style="margin-left: 50px;"><em>d). Fillna store_location</em></h3>

<strong>Location is a quantitative feature so we must fill cells as much as possible.</strong>

In [332]:
df_store_location = df_filled[df_filled['store_location'].notnull()]\
                        [['store_number', 'city', 'county', 'store_location']].drop_duplicates().reset_index()

In [333]:
df_store_location['store_location_x'] = df_store_location['store_location'].apply(lambda x: x[7:-1].split(' ')[0])
df_store_location['store_location_y'] = df_store_location['store_location'].apply(lambda x: x[7:-1].split(' ')[1])
df_store_location['store_location_x'] = df_store_location['store_location_x'].astype('float')
df_store_location['store_location_y'] = df_store_location['store_location_y'].astype('float')

Check outliers

In [334]:
df_store_location[df_store_location['store_location_x'] > \
                  df_store_location['store_location_x'].mean() + 3 * df_store_location['store_location_x'].std()]

,index,store_number,city,county,store_location,store_location_x,store_location_y
2229,165696,5876,West Bend,Palo Alto,POINT (-73.982421 40.305231000000006),-73.982421,40.305231

In [335]:
df_store_location[df_store_location['store_location_y'] > \
                  df_store_location['store_location_y'].mean() + 3 * df_store_location['store_location_y'].std()]

,index,store_number,city,county,store_location,store_location_x,store_location_y
1235,6482,4722,Burlington,Des Moines,POINT (-95.79728 45.009612),-95.79728,45.009612

Google real coordinates and change values.

In [336]:
df_filled.loc[df_filled['store_number'] == '5876', 'store_location'] = 'POINT (-94.445100 42.960000)'
df_filled.loc[df_filled['store_number'] == '4722', 'store_location'] = 'POINT (-91.112900 40.807700)'

In [337]:
df_store_location = df_filled[df_filled['store_location'].notnull()]\
                        [['store_number', 'city', 'county', 'store_location']].drop_duplicates().reset_index(drop=True)
df_store_location['store_location_x'] = df_store_location['store_location'].apply(lambda x: x[7:-1].split(' ')[0])
df_store_location['store_location_y'] = df_store_location['store_location'].apply(lambda x: x[7:-1].split(' ')[1])
df_store_location['store_location_x'] = df_store_location['store_location_x'].astype('float')
df_store_location['store_location_y'] = df_store_location['store_location_y'].astype('float')

In [338]:
df_isnull = df_filled.loc[(df_filled['store_location'].isnull())]
df_notnull = df_filled.loc[~(df_filled['store_location'].isnull())]

In [339]:
df_isnull.shape

(1951877, 24)

Join nulled by store_num. If we can see nulled field again then join by avg by city else join by avg by county

In [340]:
df_store_location_by_store = df_store_location[['store_number', 'city', 'store_location']].\
                            drop_duplicates(subset=['store_number', 'city'], keep='first')
df_isnull = df_isnull.drop(columns='store_location').\
                            merge(df_store_location_by_store, on=['store_number', 'city'], how='left')
print(df_isnull.shape)
df_isnull_container = df_isnull.loc[~(df_isnull['store_location'].isnull())]

(1951877, 24)

In [341]:
df_isnull = df_isnull.loc[(df_isnull['store_location'].isnull())]
df_isnull.shape

(1759402, 24)

In [342]:
df_store_location_by_city = df_store_location[['city', 'store_location_x', 'store_location_y']].\
                            groupby('city').agg({'store_location_x': 'mean', 'store_location_y': 'mean'}).reset_index()
df_store_location_by_city['store_location_x'] = df_store_location_by_city['store_location_x'].astype('str')
df_store_location_by_city['store_location_y'] = df_store_location_by_city['store_location_y'].astype('str')
df_store_location_by_city['store_location'] = df_store_location_by_city[['store_location_x', 'store_location_y']].\
                                        agg(' '.join, axis=1).apply(lambda x: 'POINT ('+x+')')
df_store_location_by_city = df_store_location_by_city.drop(columns=['store_location_x', 'store_location_y'])
df_isnull = df_isnull.drop(columns='store_location').\
                            merge(df_store_location_by_city, on=['city'], how='left')
print(df_isnull.shape)
df_isnull_container = pd.concat([df_isnull_container, df_isnull.loc[~(df_isnull['store_location'].isnull())]])

(1759402, 24)

In [343]:
df_isnull = df_isnull.loc[(df_isnull['store_location'].isnull())]
df_isnull.shape

(15501, 24)

In [344]:
store_location = \
   'POINT (' + str(df_store_location['store_location_x'].mean()) +' '+ str(df_store_location['store_location_y'].mean()) +')'
df_isnull['store_location'] = store_location
df_isnull_container = pd.concat([df_isnull_container, df_isnull])

In [345]:
print(df_isnull_container.shape)
df_filled = pd.concat([df_notnull, df_isnull_container])
print(df_filled.shape)

(1951877, 24)
(20349536, 24)

In [346]:
print(df_filled['store_location'].isnull().sum())

0

In [347]:
df_filled = df_filled.reset_index(drop=True)

<h3 style="margin-left: 50px;"><em>e). Fillna vendor_number and vendor_name</em></h3>

In [348]:
df_filled[['vendor_number', 'vendor_name', 'item_number', 'item_description']]\
            [(df_filled['vendor_number'].isnull())|(df_filled['vendor_name'].isnull())]

,vendor_number,vendor_name,item_number,item_description
654606,NaN,RESERVOIR DISTILLERY,927565,Reservoir Wheat Whiskey
5104885,NaN,NaN,973449,Dekuyper Blood Orange
8313089,NaN,NaN,910621,Canadian Club Whisky Mini
16204295,NaN,NaN,984151,99 Oranges
16708893,NaN,RESERVOIR DISTILLERY,916456,Reservoir Bourbon Whiskey

In [351]:
df_filled.loc[(df_filled['vendor_number'].isnull())|(df_filled['item_description'] == 'Reservoir Wheat Whiskey'),\
                                                         'vendor_number'] = '286.0'
df_filled.loc[(df_filled['vendor_number'].isnull())|(df_filled['item_description'] == 'Dekuyper Blood Orange'),\
                                                         'vendor_number'] = '309.0'
df_filled.loc[(df_filled['vendor_number'].isnull())|(df_filled['item_description'] == 'Dekuyper Blood Orange'),\
                                                         'vendor_name'] = 'Dekuyper'
df_filled.loc[(df_filled['vendor_number'].isnull())|(df_filled['item_description'] == 'Canadian Club Whisky Mini'),\
                                                         'vendor_number'] = '65.0'
df_filled.loc[(df_filled['vendor_number'].isnull())|(df_filled['item_description'] == 'Canadian Club Whisky Mini'),\
                                                         'vendor_name'] = 'JIM BEAM BRANDS'
df_filled.loc[(df_filled['vendor_number'].isnull())|(df_filled['item_description'] == '99 Oranges'),\
                                                         'vendor_number'] = '55.0'
df_filled.loc[(df_filled['vendor_number'].isnull())|(df_filled['item_description'] == '99 Oranges'),\
                                                         'vendor_name'] = 'SAZERAC NORTH AMERICA'

In [353]:
df_filled = df_filled.reset_index(drop=True)

<h3 style="margin-left: 50px;"><em>f). Fillna category and category_name</em></h3>

In [378]:
df_isnull = df_filled.loc[(df_filled['category'].isnull())|(df_filled['category_name'].isnull())]
df_notnull = df_filled.loc[~((df_filled['category'].isnull())|(df_filled['category_name'].isnull()))]

In [382]:
df_category = df_notnull[['item_description', 'category', 'category_name']].\
                        drop_duplicates(subset=['item_description'], keep='first')
df_isnull = df_isnull.drop(columns=['category', 'category_name']).merge(df_category, how='left', on=['item_description'])

Fill remaining categories as '-'

In [385]:
df_isnull['category'] = df_isnull['category'].fillna('-')
df_isnull['category_name'] = df_isnull['category_name'].fillna('-')

In [386]:
df_filled = pd.concat([df_notnull, df_isnull])

In [387]:
df_filled = df_filled.reset_index(drop=True)

<h3 style="margin-left: 50px;"><em>g). Fillna state_bottle_cost, state_bottle_retail, sale_dollars</em></h3>

In [395]:
df_isnull = df_filled.loc[((df_filled['state_bottle_cost'].isnull())|\
              (df_filled['state_bottle_retail'].isnull())|(df_filled['sale_dollars'].isnull()))]
df_notnull = df_filled.loc[~((df_filled['state_bottle_cost'].isnull())|\
              (df_filled['state_bottle_retail'].isnull())|(df_filled['sale_dollars'].isnull()))]

In [396]:
df_bottle_cost = df_notnull[['item_description', 'store_number', 'state_bottle_cost', 'state_bottle_retail']].\
                        drop_duplicates(subset=['item_description', 'store_number'], keep='first')

In [398]:
df_isnull = df_isnull.drop(columns=['state_bottle_cost', 'state_bottle_retail']).\
                merge(df_bottle_cost, on=['item_description', 'store_number'], how='left')
df_isnull['state_bottle_cost'] = df_isnull['state_bottle_cost'].fillna(12.8)
df_isnull['state_bottle_retail'] = df_isnull['state_bottle_cost'].fillna(19.2)
df_isnull['sale_dollars'] = df_isnull['state_bottle_retail'] * df_isnull['bottles_sold']

In [400]:
df_filled = pd.concat([df_notnull, df_isnull])
df_filled = df_filled.reset_index(drop=True)

In [401]:
df_filled.isnull().sum()

index                      0
invoice_and_item_number    0
date                       0
store_number               0
store_name                 0
address                    0
city                       0
zip_code                   0
store_location             0
county_number              0
county                     0
category                   0
category_name              0
vendor_number              0
vendor_name                0
item_number                0
item_description           0
pack                       0
bottle_volume_ml           0
state_bottle_cost          0
state_bottle_retail        0
bottles_sold               0
sale_dollars               0
volume_sold_liters         0
volume_sold_gallons        0
dtype: int64

<h3><strong>Conclusions: Dropped only two rows, beacause they didn't belong to the IOWA. Well filled numerical variables and city</strong></h3>

<h2><ul><li><strong>Anomalies/Outliers</strong></li></ul></h2>